---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.IDuctPressureDropServer.Calculate(Autodesk.Revit.DB.Mechanical.DuctPressureDropData)
source: html/d4f5aaf9-8e0b-fc55-3cc2-6cff3e2b630d.htm
---
# Autodesk.Revit.DB.Mechanical.IDuctPressureDropServer.Calculate Method

Calculate the duct pressure drop.

## Syntax (C#)
```csharp
void Calculate(
	DuctPressureDropData data
)
```

## Parameters
- **data** (`Autodesk.Revit.DB.Mechanical.DuctPressureDropData`) - The input and output data of the calculation.